In [2]:
import pandas as pd, numpy as np, matplotlib.pyplot as plt, seaborn as sb

In [10]:
# 데이터 불러오기
df_2023 = pd.read_csv("지역별수출실적_2023.CSV")
df_2024= pd.read_csv("지역별수출실적_2024.CSV")
df_2025= pd.read_csv("지역별수출실적_2025.CSV")

In [11]:
df_2023.head()

,Car,Region,Jan,Feb,Mar,Apr,May,Jun,Jul,Aug,Sep,Oct,Nov,Dec
0,Passenger Car,US,1048.0,633.0,627.0,245.0,0.0,0.0,2.0,0.0,0.0,4.0,0.0,5.0
1,Recreational Vehicle,US,33056.0,29697.0,31985.0,29103.0,28763.0,26013.0,27234.0,22619.0,20969.0,24759.0,33951.0,30920.0
2,Commercial Vehicle,US,0.0,0.0,0.0,0.0,0.0,0.0,NaN,0.0,0.0,0.0,0.0,0.0
3,Special Vehicle,US,0.0,0.0,0.0,0.0,0.0,NaN,NaN,NaN,0.0,0.0,0.0,NaN
4,"CKD(Inc, Special Vehicle)",US,0.0,0.0,0.0,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [14]:
df_2023["연도"] = 2023

In [15]:
df_2023.head()

,Car,Region,Jan,Feb,Mar,Apr,May,Jun,Jul,Aug,Sep,Oct,Nov,Dec,연도
0,Passenger Car,US,1048.0,633.0,627.0,245.0,0.0,0.0,2.0,0.0,0.0,4.0,0.0,5.0,2023
1,Recreational Vehicle,US,33056.0,29697.0,31985.0,29103.0,28763.0,26013.0,27234.0,22619.0,20969.0,24759.0,33951.0,30920.0,2023
2,Commercial Vehicle,US,0.0,0.0,0.0,0.0,0.0,0.0,NaN,0.0,0.0,0.0,0.0,0.0,2023
3,Special Vehicle,US,0.0,0.0,0.0,0.0,0.0,NaN,NaN,NaN,0.0,0.0,0.0,NaN,2023
4,"CKD(Inc, Special Vehicle)",US,0.0,0.0,0.0,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2023

In [16]:
df_2023.columns

Index(['Car', 'Region', 'Jan', 'Feb', 'Mar', 'Apr', 'May', 'Jun', 'Jul', 'Aug',
       'Sep', 'Oct', 'Nov', 'Dec', '연도'],
      dtype='object')

In [12]:
df_2024.head()

,Car,Region,Jan,Feb,Mar,Apr,May,Jun,Jul,Aug,Sep,Oct,Nov,Dec
0,Passenger Car,US,-,-,"3,342","6,359","8,136","7,818","8,203","7,420","6,946","5,154","1,140","6,458"
1,Recreational Vehicle,US,"34,743","28,607","30,867","35,909","28,968","27,885","26,926","25,099","21,101","24,986","13,917","17,383"
2,Commercial Vehicle,US,-,-,-,NaN,-,-,NaN,-,-,-,-,-
3,Special Vehicle,US,NaN,-,-,NaN,-,-,NaN,-,-,-,-,-
4,"CKD(excl, Special Vehicle)",US,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [17]:
df_2024["연도"] = 2024

In [18]:
df_2024.columns

Index(['Car', 'Region', 'Jan', 'Feb', 'Mar', 'Apr', 'May', 'Jun', 'Jul', 'Aug',
       'Sep', 'Oct', 'Nov', 'Dec', '연도'],
      dtype='object')

In [13]:
df_2025.head()

                          Car Region      Jan
0               Passenger Car     US   4518.0
1        Recreational Vehicle     US  23997.0
2          Commercial Vehicle     US      NaN
3             Special Vehicle     US      NaN
4  CKD(excl, Special Vehicle)     US      NaN

In [19]:
df_2025["연도"] = 2025

In [20]:
df_2025.columns

Index(['Car', 'Region', 'Jan', '연도'], dtype='object')

In [22]:
df = pd.concat([df_2023, df_2024, df_2025], ignore_index=True)

In [24]:
df

,Car,Region,Jan,Feb,Mar,Apr,May,Jun,Jul,Aug,Sep,Oct,Nov,Dec,연도
0,Passenger Car,US,1048.0,633.0,627.0,245.0,0.0,0.0,2.0,0.0,0.0,4.0,0.0,5.0,2023
1,Recreational Vehicle,US,33056.0,29697.0,31985.0,29103.0,28763.0,26013.0,27234.0,22619.0,20969.0,24759.0,33951.0,30920.0,2023
2,Commercial Vehicle,US,0.0,0.0,0.0,0.0,0.0,0.0,NaN,0.0,0.0,0.0,0.0,0.0,2023
3,Special Vehicle,US,0.0,0.0,0.0,0.0,0.0,NaN,NaN,NaN,0.0,0.0,0.0,NaN,2023
4,"CKD(Inc, Special Vehicle)",US,0.0,0.0,0.0,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2023
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
185,Recreational Vehicle,China,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2025
186,Commercial Vehicle,China,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2025
187,Special Vehicle,China,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2025
188,"CKD(excl, Special Vehicle)",China,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2025
189,CKD(Special Vehicle),China,0.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,2025

In [27]:
df.isna().sum()

Car         0
Region      0
Jan        48
Feb        80
Mar        84
Apr        90
May        89
Jun        91
Jul       107
Aug        87
Sep        96
Oct        96
Nov        91
Dec        97
연도          0
dtype: int64

In [28]:
df.fillna(0, inplace=True)

In [29]:
df.isna().sum()

Car       0
Region    0
Jan       0
Feb       0
Mar       0
Apr       0
May       0
Jun       0
Jul       0
Aug       0
Sep       0
Oct       0
Nov       0
Dec       0
연도        0
dtype: int64

In [30]:
df.to_csv("지역별수출실적.CSV", index=False)

In [31]:
df.head()

,Car,Region,Jan,Feb,Mar,Apr,May,Jun,Jul,Aug,Sep,Oct,Nov,Dec,연도
0,Passenger Car,US,1048.0,633.0,627.0,245.0,0.0,0.0,2.0,0.0,0.0,4.0,0.0,5.0,2023
1,Recreational Vehicle,US,33056.0,29697.0,31985.0,29103.0,28763.0,26013.0,27234.0,22619.0,20969.0,24759.0,33951.0,30920.0,2023
2,Commercial Vehicle,US,0.0,0.0,0.0,0.0,0.0,0.0,0,0.0,0.0,0.0,0.0,0.0,2023
3,Special Vehicle,US,0.0,0.0,0.0,0.0,0.0,0,0,0,0.0,0.0,0.0,0,2023
4,"CKD(Inc, Special Vehicle)",US,0.0,0.0,0.0,0.0,0,0,0,0,0,0,0,0,2023

In [32]:
df.columns

Index(['Car', 'Region', 'Jan', 'Feb', 'Mar', 'Apr', 'May', 'Jun', 'Jul', 'Aug',
       'Sep', 'Oct', 'Nov', 'Dec', '연도'],
      dtype='object')

In [38]:
# 기존 컬럼명과 변경할 컬럼명 매핑
column_mapping = {
    'Car': '차량 구분',
    'Region': '국가명',
    'Year': '연도',  # 'Year' 컬럼이 존재하는 경우
    'Jan': '1월',
    'Feb': '2월',
    'Mar': '3월',
    'Apr': '4월',
    'May': '5월',
    'Jun': '6월',
    'Jul': '7월',
    'Aug': '8월',
    'Sep': '9월',
    'Oct': '10월',
    'Nov': '11월',
    'Dec': '12월'
}

# 컬럼명 변경
df.columns = [column_mapping.get(col, col) for col in df.columns]

# 변경된 컬럼명 확인
df.columns

Index(['차량 구분', '국가명', '1월', '2월', '3월', '4월', '5월', '6월', '7월', '8월', '9월',
       '10월', '11월', '12월', '연도'],
      dtype='object')

In [39]:
df.head()

,차량 구분,국가명,1월,2월,3월,4월,5월,6월,7월,8월,9월,10월,11월,12월,연도
0,Passenger Car,US,1048.0,633.0,627.0,245.0,0.0,0.0,2.0,0.0,0.0,4.0,0.0,5.0,2023
1,Recreational Vehicle,US,33056.0,29697.0,31985.0,29103.0,28763.0,26013.0,27234.0,22619.0,20969.0,24759.0,33951.0,30920.0,2023
2,Commercial Vehicle,US,0.0,0.0,0.0,0.0,0.0,0.0,0,0.0,0.0,0.0,0.0,0.0,2023
3,Special Vehicle,US,0.0,0.0,0.0,0.0,0.0,0,0,0,0.0,0.0,0.0,0,2023
4,"CKD(Inc, Special Vehicle)",US,0.0,0.0,0.0,0.0,0,0,0,0,0,0,0,0,2023

In [41]:
df['차량 구분'].unique()

array(['Passenger Car', 'Recreational Vehicle', 'Commercial Vehicle',
       'Special Vehicle', 'CKD(Inc, Special Vehicle)', 'Total',
       'CKD(excl, Special Vehicle)', 'CKD(Special Vehicle)'], dtype=object)

In [42]:
# 기존 값과 변경할 값 매핑
car_mapping = {
    'Passenger Car': '승용차',
    'Recreational Vehicle': '휴양용 차량',
    'Commercial Vehicle': '상업용 차량',
    'Special Vehicle': '특수 차량',
    'CKD(Inc, Special Vehicle)': 'CKD(모듈형 조립 방식)',
    'Total': '총합',
    'CKD(excl, Special Vehicle)': 'CKD(특수 차량 제외)',
    'CKD(Special Vehicle)': 'CKD(특수 차량)'
}

# 'Car' 컬럼 데이터 변경
df['차량 구분'] = df['차량 구분'].replace(car_mapping)

# 변경된 데이터 확인
df['차량 구분'].unique()

array(['승용차', '휴양용 차량', '상업용 차량', '특수 차량', 'CKD(모듈형 조립 방식)', '총합',
       'CKD(특수 차량 제외)', 'CKD(특수 차량)'], dtype=object)

In [43]:
df.head()

,차량 구분,국가명,1월,2월,3월,4월,5월,6월,7월,8월,9월,10월,11월,12월,연도
0,승용차,US,1048.0,633.0,627.0,245.0,0.0,0.0,2.0,0.0,0.0,4.0,0.0,5.0,2023
1,휴양용 차량,US,33056.0,29697.0,31985.0,29103.0,28763.0,26013.0,27234.0,22619.0,20969.0,24759.0,33951.0,30920.0,2023
2,상업용 차량,US,0.0,0.0,0.0,0.0,0.0,0.0,0,0.0,0.0,0.0,0.0,0.0,2023
3,특수 차량,US,0.0,0.0,0.0,0.0,0.0,0,0,0,0.0,0.0,0.0,0,2023
4,CKD(모듈형 조립 방식),US,0.0,0.0,0.0,0.0,0,0,0,0,0,0,0,0,2023

In [44]:
df.to_csv("지역별수출실적_전처리.CSV", index=False)

In [86]:
# 데이터 불러오기
df_2023 = pd.read_csv("차종별판매실적_2023.CSV")
df_2024= pd.read_csv("차종별판매실적_2024.CSV")
df_2025= pd.read_csv("차종별판매실적_2025.CSV")

In [87]:
df_2023.head()

,Model,Vehicle Type,Trade,Jan,Feb,Mar,Apr,May,Jun,Jul,Aug,Sep,Oct,Nov,Dec
0,Morning,Ordinary Vehicle,Domestic,1813.0,2049.0,2127.0,2164.0,2502.0,2245.0,2033.0,2910.0,1892.0,2225.0,2111.0,1808.0
1,Ray,Ordinary Vehicle,Domestic,3585.0,4268.0,4155.0,4158.0,4576.0,4372.0,4285.0,4402.0,3464.0,4824.0,4587.0,4254.0
2,K3,Ordinary Vehicle,Domestic,950.0,1024.0,1197.0,670.0,975.0,1540.0,976.0,1123.0,1036.0,939.0,1428.0,1346.0
3,K5,Ordinary Vehicle,Domestic,2560.0,2653.0,3421.0,2739.0,3166.0,2963.0,2246.0,2613.0,2280.0,2592.0,3783.0,3563.0
4,Stinger,Ordinary Vehicle,Domestic,113.0,120.0,143.0,61.0,45.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0

In [88]:
df_2023["연도"] = 2023

In [89]:
df_2023.columns

Index(['Model', 'Vehicle Type', 'Trade', 'Jan', 'Feb', 'Mar', 'Apr', 'May',
       'Jun', 'Jul', 'Aug', 'Sep', 'Oct', 'Nov', 'Dec', '연도'],
      dtype='object')

In [90]:
df_2024.head()

,Model,Vehicle Type,Trade,Jan,Feb,Mar,Apr,May,Jun,Jul,Aug,Sep,Oct,Nov,Dec
0,Morning,Ordinary Vehicle,Domestic,"1,214","1,140","1,416","1,421",907,985,"1,335",910,968,"1,464","1,467","2,608"
1,Ray,Ordinary Vehicle,Domestic,"4,130","3,972","4,692","4,460","4,456","3,574","4,384","3,710","3,363","3,278","4,753","4,219"
2,K3,Ordinary Vehicle,Domestic,"1,419","1,315","1,460","1,336",995,"1,341","1,373",588,4,NaN,NaN,NaN
3,K5,Ordinary Vehicle,Domestic,"3,336","2,970","3,577","3,168","2,405","2,932","2,702","2,690","2,277","3,030","2,645","2,105"
4,EV4,Ordinary Vehicle,Domestic,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,0

In [91]:
df_2024["연도"] = 2024

In [92]:
df_2024.columns

Index(['Model', 'Vehicle Type', 'Trade', 'Jan', 'Feb', 'Mar', 'Apr', 'May',
       'Jun', 'Jul', 'Aug', 'Sep', 'Oct', 'Nov', 'Dec', '연도'],
      dtype='object')

In [93]:
df_2025.head()

      Model      Vehicle Type     Trade   Jan
0   Morning  Ordinary Vehicle  Domestic  1484
1       Ray  Ordinary Vehicle  Domestic  3876
2        K3  Ordinary Vehicle  Domestic     0
3       EV4  Ordinary Vehicle  Domestic     0
4        K5  Ordinary Vehicle  Domestic  2583

In [94]:
df_2025["연도"] = 2025

In [95]:
df_2025.columns

Index(['Model', 'Vehicle Type', 'Trade', 'Jan', '연도'], dtype='object')

In [96]:
df = pd.concat([df_2023, df_2024, df_2025], ignore_index=True)

In [97]:
df.to_csv("차종별판매실적.CSV", index=False)

In [98]:
df = pd.read_csv("차종별판매실적.CSV")

In [99]:
df.columns

Index(['Model', 'Vehicle Type', 'Trade', 'Jan', 'Feb', 'Mar', 'Apr', 'May',
       'Jun', 'Jul', 'Aug', 'Sep', 'Oct', 'Nov', 'Dec', '연도'],
      dtype='object')

In [100]:
# 기존 컬럼명과 변경할 컬럼명 매핑
column_mapping = {
    'Model':'차종',
    'Vehicle Type': '차량 구분',
    'Trade': '거래 유형',
    'Year': '연도',  # 'Year' 컬럼이 존재하는 경우
    'Jan': '1월',
    'Feb': '2월',
    'Mar': '3월',
    'Apr': '4월',
    'May': '5월',
    'Jun': '6월',
    'Jul': '7월',
    'Aug': '8월',
    'Sep': '9월',
    'Oct': '10월',
    'Nov': '11월',
    'Dec': '12월'
}

# 컬럼명 변경
df.columns = [column_mapping.get(col, col) for col in df.columns]

# 변경된 컬럼명 확인
df.columns

Index(['차종', '차량 구분', '거래 유형', '1월', '2월', '3월', '4월', '5월', '6월', '7월', '8월',
       '9월', '10월', '11월', '12월', '연도'],
      dtype='object')

In [101]:
df.head()

,차종,차량 구분,거래 유형,1월,2월,3월,4월,5월,6월,7월,8월,9월,10월,11월,12월,연도
0,Morning,Ordinary Vehicle,Domestic,1813.0,2049.0,2127.0,2164.0,2502.0,2245.0,2033.0,2910.0,1892.0,2225.0,2111.0,1808.0,2023
1,Ray,Ordinary Vehicle,Domestic,3585.0,4268.0,4155.0,4158.0,4576.0,4372.0,4285.0,4402.0,3464.0,4824.0,4587.0,4254.0,2023
2,K3,Ordinary Vehicle,Domestic,950.0,1024.0,1197.0,670.0,975.0,1540.0,976.0,1123.0,1036.0,939.0,1428.0,1346.0,2023
3,K5,Ordinary Vehicle,Domestic,2560.0,2653.0,3421.0,2739.0,3166.0,2963.0,2246.0,2613.0,2280.0,2592.0,3783.0,3563.0,2023
4,Stinger,Ordinary Vehicle,Domestic,113.0,120.0,143.0,61.0,45.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,2023

In [102]:
df['차량 구분'].unique()

array(['Ordinary Vehicle', 'Special Vehicle'], dtype=object)

In [103]:
# 기존 값과 변경할 값 매핑
car_mapping = {
    'Ordinary Vehicle': '일반 차량',
    'Special Vehicle': '특수 차량',

}

# 'Car' 컬럼 데이터 변경
df['차량 구분'] = df['차량 구분'].replace(car_mapping)

# 변경된 데이터 확인
df['차량 구분'].unique()

array(['일반 차량', '특수 차량'], dtype=object)

In [104]:
df['거래 유형'].unique()

array(['Domestic', 'Export', 'Export(excl CKD)'], dtype=object)

In [105]:
# 기존 값과 변경할 값 매핑
car_mapping = {
    'Domestic': '국내',
    'Export': '수출',
    'Export(excl CKD)': '수출(CKD 제외)'    

}

# 'Car' 컬럼 데이터 변경
df['거래 유형'] = df['거래 유형'].replace(car_mapping)

# 변경된 데이터 확인
df['거래 유형'].unique()

array(['국내', '수출', '수출(CKD 제외)'], dtype=object)

In [106]:
df.head()

,차종,차량 구분,거래 유형,1월,2월,3월,4월,5월,6월,7월,8월,9월,10월,11월,12월,연도
0,Morning,일반 차량,국내,1813.0,2049.0,2127.0,2164.0,2502.0,2245.0,2033.0,2910.0,1892.0,2225.0,2111.0,1808.0,2023
1,Ray,일반 차량,국내,3585.0,4268.0,4155.0,4158.0,4576.0,4372.0,4285.0,4402.0,3464.0,4824.0,4587.0,4254.0,2023
2,K3,일반 차량,국내,950.0,1024.0,1197.0,670.0,975.0,1540.0,976.0,1123.0,1036.0,939.0,1428.0,1346.0,2023
3,K5,일반 차량,국내,2560.0,2653.0,3421.0,2739.0,3166.0,2963.0,2246.0,2613.0,2280.0,2592.0,3783.0,3563.0,2023
4,Stinger,일반 차량,국내,113.0,120.0,143.0,61.0,45.0,1.0,0.0,0.0,0.0,0.0,0.0,0.0,2023

In [117]:
df.isna().sum()

차종        0
차량 구분     0
거래 유형     0
1월       13
2월       65
3월       65
4월       66
5월       67
6월       64
7월       68
8월       68
9월       69
10월      68
11월      69
12월      66
연도        0
dtype: int64

In [118]:
df.fillna(0, inplace=True)

In [120]:
df.isna().sum()

차종       0
차량 구분    0
거래 유형    0
1월       0
2월       0
3월       0
4월       0
5월       0
6월       0
7월       0
8월       0
9월       0
10월      0
11월      0
12월      0
연도       0
dtype: int64

In [121]:
df.to_csv("차종별판매실적_전처리.CSV", index=False)

In [348]:
# 데이터 불러오기
df_2023 = pd.read_csv("해외공장판매실적_2023.CSV")
df_2024= pd.read_csv("해외공장판매실적_2024.CSV")
df_2025= pd.read_csv("해외공장판매실적_2025.CSV")

In [349]:
df_2023.head()

,Plant,Plant Code,Model,Jan,Feb,Mar,Apr,May,Jun,Jul,Aug,Sep,Oct,Nov,Dec
0,US Plant,KaGA,Optima / K5,5701,6150,6635,5652,6396.0,5050.0,4771.0,6853.0,6150.0,6550.0,5900.0,3445.0
1,US Plant,KaGA,Sportage,6400,7950,9129,7358,8424.0,6142.0,5900.0,8450.0,7350.0,8150.0,7600.0,6150.0
2,US Plant,KaGA,Sorento,6795,5330,5385,6184,7368.0,6416.0,5513.0,7491.0,6602.0,7097.0,6100.0,4825.0
3,US Plant,KaGA,Telluride,9704,10400,11851,10206,11212.0,8792.0,8216.0,12313.0,10698.0,11903.0,10300.0,7850.0
4,China Plant,DYK,Pegas,3320,3436,3504,3465,3710.0,3548.0,3572.0,5866.0,7042.0,4121.0,5645.0,4495.0

In [350]:
df_2023["연도"] = 2023

In [351]:
df_2024.head()

,Plant,Plant Code,Model,Jan,Feb,Mar,Apr,May,Jun,Jul,Aug,Sep,Oct,Nov,Dec
0,US Plant,KaGA,K5,"1,286",30,4,15,2,0,0,0,NaN,NaN,NaN,NaN
1,US Plant,KaGA,Sportage,"8,100","9,920","9,546","10,735","10,048","9,300","8,800","11,520","10,350","11,150","9,000","6,720"
2,US Plant,KaGA,Sorento,"6,442","9,849","10,049","10,150","10,449","8,650","8,249","9,380","9,237","10,520","7,972","4,718"
3,US Plant,KaGA,Telluride,"9,172","10,901","10,401","11,500","11,401","10,050","9,851","12,190","11,302","12,300","10,118","8,192"
4,US Plant,KaGA,EV9,NaN,NaN,NaN,NaN,NaN,NaN,NaN,10,11,130,"1,210","1,170"

In [352]:
df_2024['Plant'].unique()

array(['US Plant', 'China Plants', 'Slovakia Plant', 'Mexico Plant',
       'India Plant'], dtype=object)

In [353]:
df_2024['Plant Code'].unique()

array(['KaGA', 'DYK', 'KaSK', 'KMX', 'KIN'], dtype=object)

In [354]:
df_2024["연도"] = 2024

In [355]:
df_2024.columns

Index(['Plant', 'Plant Code', 'Model', 'Jan', 'Feb', 'Mar', 'Apr', 'May',
       'Jun', 'Jul', 'Aug', 'Sep', 'Oct', 'Nov', 'Dec', '연도'],
      dtype='object')

In [356]:
df_2025.head()

,model,path,month,Jan,Feb,Mar,Apr,May,Jun,Jul,Aug,Sep,Oct,Nov,Dec
0,K5,US Plant,Jan,NaN,0,0,0,0,0,0,0,0,0,0,0
1,Sportage,US Plant,Jan,"9,247",0,0,0,0,0,0,0,0,0,0,0
2,Sorento,US Plant,Jan,"8,300",0,0,0,0,0,0,0,0,0,0,0
3,Telluride,US Plant,Jan,"10,350",0,0,0,0,0,0,0,0,0,0,0
4,EV6,US Plant,Jan,103,0,0,0,0,0,0,0,0,0,0,0

In [357]:
df_2025["연도"] = 2025

In [358]:
df_2025.columns

Index(['model', 'path', 'month', 'Jan', 'Feb', 'Mar', 'Apr', 'May', 'Jun',
       'Jul', 'Aug', 'Sep', 'Oct', 'Nov', 'Dec', '연도'],
      dtype='object')

In [359]:
df_2025 = df_2025.drop(columns=['month'])

In [360]:
df_2025.columns

Index(['model', 'path', 'Jan', 'Feb', 'Mar', 'Apr', 'May', 'Jun', 'Jul', 'Aug',
       'Sep', 'Oct', 'Nov', 'Dec', '연도'],
      dtype='object')

In [361]:
df_2025['path'].unique()

array(['US Plant', 'China Plants', 'Slovakia Plant', 'Mexico Plant',
       'India Plant'], dtype=object)

In [362]:
# 공장명과 대응하는 코드 매핑
plant_code_mapping = {
    'US Plant': 'KaGA',
    'China Plants': 'DYK',
    'Slovakia Plant': 'KaSK',
    'Mexico Plant': 'KMX',
    'India Plant': 'KIN'
}

# 새로운 컬럼 'Plant Code' 생성
df_2025['Plant Code'] = df_2025['path'].replace(plant_code_mapping)

# 변경된 데이터 확인
print(df_2025[['path', 'Plant Code']].drop_duplicates())

              path Plant Code
0         US Plant       KaGA
6     China Plants        DYK
17  Slovakia Plant       KaSK
20    Mexico Plant        KMX
24     India Plant        KIN

In [363]:
df_2025.columns

Index(['model', 'path', 'Jan', 'Feb', 'Mar', 'Apr', 'May', 'Jun', 'Jul', 'Aug',
       'Sep', 'Oct', 'Nov', 'Dec', '연도', 'Plant Code'],
      dtype='object')

In [364]:
# 기존 값과 변경할 값 매핑
car_mapping = {
    'path': 'Plant',
    'model':'Model'

}

# 'Car' 컬럼 데이터 변경
df_2025['Plant'] = df_2025['path'].replace(car_mapping)
df_2025['Model'] = df_2025['model'].replace(car_mapping)

# 변경된 데이터 확인
df_2025['Plant'].unique()
df_2025['Model'].unique()

array(['K5', 'Sportage', 'Sorento', 'Telluride', 'EV6', 'EV9', 'Pegas',
       'Forte', 'K3', 'KX1', 'Sonet', 'KX3', 'Zhipao', 'EV5', 'KX5',
       'Carnival', "C'eed", "C'eed CUV", 'Rio(pride)', 'K4',
       'Tucson(NX4)', 'Syros', 'Seltos', 'Carens MPV'], dtype=object)

In [365]:
df_2025.columns

Index(['model', 'path', 'Jan', 'Feb', 'Mar', 'Apr', 'May', 'Jun', 'Jul', 'Aug',
       'Sep', 'Oct', 'Nov', 'Dec', '연도', 'Plant Code', 'Plant', 'Model'],
      dtype='object')

In [366]:
df_2025 = df_2025.drop(columns=['path','model'])

In [367]:
# 원하는 컬럼 순서 지정
new_column_order = ['Plant','Plant Code', 'Model','Jan', 'Feb', 'Mar', 'Apr', 'May', 'Jun',
       'Jul', 'Aug', 'Sep', 'Oct', 'Nov', 'Dec', '연도']

# df_2025에서 실제 존재하는 컬럼만 필터링
existing_columns = [col for col in new_column_order if col in df_2025.columns]

# 컬럼 순서 변경
df_2025 = df_2025[existing_columns]

# 변경된 컬럼 확인
print(df_2025.columns)

Index(['Plant', 'Plant Code', 'Model', 'Jan', 'Feb', 'Mar', 'Apr', 'May',
       'Jun', 'Jul', 'Aug', 'Sep', 'Oct', 'Nov', 'Dec', '연도'],
      dtype='object')

In [368]:
df_2025.head()

,Plant,Plant Code,Model,Jan,Feb,Mar,Apr,May,Jun,Jul,Aug,Sep,Oct,Nov,Dec,연도
0,US Plant,KaGA,K5,NaN,0,0,0,0,0,0,0,0,0,0,0,2025
1,US Plant,KaGA,Sportage,"9,247",0,0,0,0,0,0,0,0,0,0,0,2025
2,US Plant,KaGA,Sorento,"8,300",0,0,0,0,0,0,0,0,0,0,0,2025
3,US Plant,KaGA,Telluride,"10,350",0,0,0,0,0,0,0,0,0,0,0,2025
4,US Plant,KaGA,EV6,103,0,0,0,0,0,0,0,0,0,0,0,2025

In [369]:
df = pd.concat([df_2023, df_2024, df_2025], ignore_index=True)

In [370]:
df.head()

,Plant,Plant Code,Model,Jan,Feb,Mar,Apr,May,Jun,Jul,Aug,Sep,Oct,Nov,Dec,연도
0,US Plant,KaGA,Optima / K5,5701,6150,6635,5652,6396.0,5050.0,4771.0,6853.0,6150.0,6550.0,5900.0,3445.0,2023
1,US Plant,KaGA,Sportage,6400,7950,9129,7358,8424.0,6142.0,5900.0,8450.0,7350.0,8150.0,7600.0,6150.0,2023
2,US Plant,KaGA,Sorento,6795,5330,5385,6184,7368.0,6416.0,5513.0,7491.0,6602.0,7097.0,6100.0,4825.0,2023
3,US Plant,KaGA,Telluride,9704,10400,11851,10206,11212.0,8792.0,8216.0,12313.0,10698.0,11903.0,10300.0,7850.0,2023
4,China Plant,DYK,Pegas,3320,3436,3504,3465,3710.0,3548.0,3572.0,5866.0,7042.0,4121.0,5645.0,4495.0,2023

In [371]:
df.isna().sum()

Plant         0
Plant Code    0
Model         0
Jan           6
Feb           4
Mar           4
Apr           4
May           5
Jun           4
Jul           4
Aug           3
Sep           4
Oct           3
Nov           4
Dec           4
연도            0
dtype: int64

In [372]:
df.fillna(0, inplace=True)

In [373]:
df.isna().sum()

Plant         0
Plant Code    0
Model         0
Jan           0
Feb           0
Mar           0
Apr           0
May           0
Jun           0
Jul           0
Aug           0
Sep           0
Oct           0
Nov           0
Dec           0
연도            0
dtype: int64

In [374]:
df.to_csv("해외공장판매실적.CSV", index=False)

In [375]:
df.head()

,Plant,Plant Code,Model,Jan,Feb,Mar,Apr,May,Jun,Jul,Aug,Sep,Oct,Nov,Dec,연도
0,US Plant,KaGA,Optima / K5,5701,6150,6635,5652,6396.0,5050.0,4771.0,6853.0,6150.0,6550.0,5900.0,3445.0,2023
1,US Plant,KaGA,Sportage,6400,7950,9129,7358,8424.0,6142.0,5900.0,8450.0,7350.0,8150.0,7600.0,6150.0,2023
2,US Plant,KaGA,Sorento,6795,5330,5385,6184,7368.0,6416.0,5513.0,7491.0,6602.0,7097.0,6100.0,4825.0,2023
3,US Plant,KaGA,Telluride,9704,10400,11851,10206,11212.0,8792.0,8216.0,12313.0,10698.0,11903.0,10300.0,7850.0,2023
4,China Plant,DYK,Pegas,3320,3436,3504,3465,3710.0,3548.0,3572.0,5866.0,7042.0,4121.0,5645.0,4495.0,2023

In [376]:
df.columns

Index(['Plant', 'Plant Code', 'Model', 'Jan', 'Feb', 'Mar', 'Apr', 'May',
       'Jun', 'Jul', 'Aug', 'Sep', 'Oct', 'Nov', 'Dec', '연도'],
      dtype='object')

In [377]:
# 기존 컬럼명과 변경할 컬럼명 매핑
column_mapping = {
    'Plant':'공장명(국가)',
    'Plant Code': '공장 코드',
    'Model': '차종',
    'Jan': '1월',
    'Feb': '2월',
    'Mar': '3월',
    'Apr': '4월',
    'May': '5월',
    'Jun': '6월',
    'Jul': '7월',
    'Aug': '8월',
    'Sep': '9월',
    'Oct': '10월',
    'Nov': '11월',
    'Dec': '12월'
}

# 컬럼명 변경
df.columns = [column_mapping.get(col, col) for col in df.columns]

# 변경된 컬럼명 확인
df.columns

Index(['공장명(국가)', '공장 코드', '차종', '1월', '2월', '3월', '4월', '5월', '6월', '7월',
       '8월', '9월', '10월', '11월', '12월', '연도'],
      dtype='object')

In [378]:
df.to_csv("해외공장판매실적_전처리.CSV", index=False)

In [380]:
# 데이터 불러오기
df_2023 = pd.read_csv("해외현지판매_2023.CSV")
df_2024= pd.read_csv("해외현지판매_2024.CSV")
df_2025= pd.read_csv("해외현지판매_2025.CSV")

In [381]:
df_2023.head()

,Model,Plant,Month,U.S.A,Canada,Mexico,Europe,Eastern Europe,Latin America,Middle East,Africa,Asia Pacific,India,China
0,Morning / Picanto,Korean Plant,January,0.0,0.0,0.0,5518.0,174.0,1452.0,1110.0,1073.0,459.0,0.0,0.0
1,Pride / Rio,Korean Plant,January,0.0,0.0,0.0,3130.0,61.0,68.0,347.0,512.0,608.0,0.0,0.0
2,K3,Korean Plant,January,0.0,95.0,57.0,0.0,171.0,13.0,175.0,5.0,333.0,0.0,0.0
3,K5 / Optima,Korean Plant,January,0.0,0.0,0.0,0.0,774.0,0.0,1116.0,1.0,3.0,0.0,0.0
4,Stinger,Korean Plant,January,466.0,22.0,10.0,101.0,10.0,0.0,0.0,0.0,180.0,0.0,0.0

In [382]:
df_2023["연도"] = 2023

In [383]:
df_2024.head()

,Model,Plant,Month,Korea,U.S.A,Canada,Mexico,*Europe,Eastern Europe,Latin America,Middle East,Africa,Asia Pacific,India,China
0,Morning / Picanto,Korea Plants,January,1214.0,0.0,0.0,0.0,4726.0,68.0,1564.0,1274.0,748.0,315.0,0.0,0.0
1,Pride / Rio,Korea Plants,January,0.0,0.0,0.0,0.0,82.0,2.0,0.0,148.0,2.0,0.0,0.0,0.0
2,Ray,Korea Plants,January,4020.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,Ray EV,Korea Plants,January,110.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,K3,Korea Plants,January,1419.0,0.0,9.0,39.0,0.0,71.0,10.0,749.0,104.0,1030.0,0.0,0.0

In [384]:
df_2024["연도"] = 2024

In [385]:
df_2024.head()

,Model,Plant,Month,Korea,U.S.A,Canada,Mexico,*Europe,Eastern Europe,Latin America,Middle East,Africa,Asia Pacific,India,China,연도
0,Morning / Picanto,Korea Plants,January,1214.0,0.0,0.0,0.0,4726.0,68.0,1564.0,1274.0,748.0,315.0,0.0,0.0,2024
1,Pride / Rio,Korea Plants,January,0.0,0.0,0.0,0.0,82.0,2.0,0.0,148.0,2.0,0.0,0.0,0.0,2024
2,Ray,Korea Plants,January,4020.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,2024
3,Ray EV,Korea Plants,January,110.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,2024
4,K3,Korea Plants,January,1419.0,0.0,9.0,39.0,0.0,71.0,10.0,749.0,104.0,1030.0,0.0,0.0,2024

In [386]:
df_2025["연도"] = 2025

In [387]:
df_2025.head()

,model,Plant,Month,Korea,U.S.A,Canada,Mexico,Europe,Eastern Europe,Latin America,Middle East,Africa,Asia Pacific,India,China,연도
0,Morning / Picanto,Korea Plants,Jan,"1,484",0,0,NaN,"6,380",82,"1,440","1,290",515.0,685,0,0,2025
1,Pride / Rio,Korea Plants,Jan,0,0,0,NaN,0,0,0,0,0.0,1,0,0,2025
2,Ray,Korea Plants,Jan,"3,803",0,0,NaN,0,0,0,NaN,NaN,0,0,0,2025
3,Ray EV,Korea Plants,Jan,73,0,0,NaN,0,0,0,NaN,NaN,0,0,0,2025
4,K3,Korea Plants,Jan,0,0,5,2,0,15,5,181,70.0,409,0,0,2025

In [388]:
df_2023.columns

Index(['Model', 'Plant', 'Month', 'U.S.A', 'Canada', 'Mexico', 'Europe',
       'Eastern Europe', 'Latin America', 'Middle East', 'Africa',
       'Asia Pacific', 'India', 'China', '연도'],
      dtype='object')

In [389]:
df_2024.columns

Index(['Model', 'Plant', 'Month', 'Korea', 'U.S.A', 'Canada', 'Mexico',
       '*Europe', 'Eastern Europe', 'Latin America', 'Middle East', 'Africa',
       'Asia Pacific', 'India', 'China', '연도'],
      dtype='object')

In [390]:
df_2025.columns

Index(['model', 'Plant', 'Month', 'Korea', 'U.S.A', 'Canada', 'Mexico',
       'Europe', 'Eastern Europe', 'Latin America', 'Middle East', 'Africa',
       'Asia Pacific', 'India', 'China', '연도'],
      dtype='object')

In [391]:
# df_2024 컬럼 정리 (Model 대소문자 통일, 불필요 컬럼 드롭)
df_2024.rename(columns={'*Europe': 'Europe'}, inplace=True)
df_2024 = df_2024[['Model', 'Plant', 'Month', 'U.S.A', 'Canada', 'Mexico',
                   'Europe', 'Eastern Europe', 'Latin America',
                   'Middle East', 'Africa', 'Asia Pacific',
                   'India', 'China', '연도']]

# df_2025 컬럼 정리 ('model'→'Model' 변경, 불필요 컬럼 드롭)
df_2025.rename(columns={'model': 'Model'}, inplace=True)
df_2025 = df_2025[['Model', 'Plant', 'Month', 'U.S.A', 'Canada', 'Mexico',
                   'Europe', 'Eastern Europe', 'Latin America',
                   'Middle East', 'Africa', 'Asia Pacific',
                   'India', 'China', '연도']]

# 결과 확인
print(df_2024.columns)
print(df_2025.columns)

Index(['Model', 'Plant', 'Month', 'U.S.A', 'Canada', 'Mexico', 'Europe',
       'Eastern Europe', 'Latin America', 'Middle East', 'Africa',
       'Asia Pacific', 'India', 'China', '연도'],
      dtype='object')
Index(['Model', 'Plant', 'Month', 'U.S.A', 'Canada', 'Mexico', 'Europe',
       'Eastern Europe', 'Latin America', 'Middle East', 'Africa',
       'Asia Pacific', 'India', 'China', '연도'],
      dtype='object')

In [392]:
df = pd.concat([df_2023, df_2024, df_2025], ignore_index=True)

In [393]:
df.to_csv("해외현지판매.CSV", index=False)

In [394]:
df.head()

,Model,Plant,Month,U.S.A,Canada,Mexico,Europe,Eastern Europe,Latin America,Middle East,Africa,Asia Pacific,India,China,연도
0,Morning / Picanto,Korean Plant,January,0.0,0.0,0.0,5518.0,174.0,1452.0,1110.0,1073.0,459.0,0.0,0.0,2023
1,Pride / Rio,Korean Plant,January,0.0,0.0,0.0,3130.0,61.0,68.0,347.0,512.0,608.0,0.0,0.0,2023
2,K3,Korean Plant,January,0.0,95.0,57.0,0.0,171.0,13.0,175.0,5.0,333.0,0.0,0.0,2023
3,K5 / Optima,Korean Plant,January,0.0,0.0,0.0,0.0,774.0,0.0,1116.0,1.0,3.0,0.0,0.0,2023
4,Stinger,Korean Plant,January,466.0,22.0,10.0,101.0,10.0,0.0,0.0,0.0,180.0,0.0,0.0,2023

In [395]:
df.columns

Index(['Model', 'Plant', 'Month', 'U.S.A', 'Canada', 'Mexico', 'Europe',
       'Eastern Europe', 'Latin America', 'Middle East', 'Africa',
       'Asia Pacific', 'India', 'China', '연도'],
      dtype='object')

In [396]:
df['Month'].unique()

array(['January', 'Febuary', 'March', 'April', 'May', 'June', 'July',
       'August', 'September', 'October', 'November', 'December', 'Jan'],
      dtype=object)

In [397]:
# 기존의 월 데이터가 담긴 컬럼을 가정: df['Month']

# 월 이름 변경 매핑 사전
month_map = {
    'January': '1월',
    'Febuary': '2월',  # 오타 포함 대비
    'February': '2월',
    'March': '3월',
    'April': '4월',
    'May': '5월',
    'June': '6월',
    'July': '7월',
    'August': '8월',
    'September': '9월',
    'October': '10월',
    'November': '11월',
    'December': '12월',
    'Jan': '1월'  # 이미 축약형이지만, 통일성을 위해 추가
}

# 월 컬럼 변환 적용
df['Month'] = df['Month'].map(month_map)

# 결과 확인 (중복 확인 포함)
print(df['Month'].unique())

['1월' '2월' '3월' '4월' '5월' '6월' '7월' '8월' '9월' '10월' '11월' '12월']

In [398]:
df.columns

Index(['Model', 'Plant', 'Month', 'U.S.A', 'Canada', 'Mexico', 'Europe',
       'Eastern Europe', 'Latin America', 'Middle East', 'Africa',
       'Asia Pacific', 'India', 'China', '연도'],
      dtype='object')

In [399]:
df.to_csv("해외현지판매.CSV", index=False)

In [400]:
df.columns

Index(['Model', 'Plant', 'Month', 'U.S.A', 'Canada', 'Mexico', 'Europe',
       'Eastern Europe', 'Latin America', 'Middle East', 'Africa',
       'Asia Pacific', 'India', 'China', '연도'],
      dtype='object')

In [401]:
# 기존 컬럼명과 변경할 컬럼명 매핑
column_mapping = {
    'Model': '차종',
    'Plant':'공장명(국가)',
    'Month': '월'
}

# 컬럼명 변경
df.columns = [column_mapping.get(col, col) for col in df.columns]

# 변경된 컬럼명 확인
df.columns

Index(['차종', '공장명(국가)', '월', 'U.S.A', 'Canada', 'Mexico', 'Europe',
       'Eastern Europe', 'Latin America', 'Middle East', 'Africa',
       'Asia Pacific', 'India', 'China', '연도'],
      dtype='object')

In [ ]:
# melt를 통해 국가명 컬럼들을 하나의 컬럼으로 통합합니다.
df_melted = df.melt(id_vars=['차종', '공장명(국가)', '월', '연도'],
                    value_vars=['U.S.A', 'Canada', 'Mexico', 'Europe', 'Eastern Europe',
                                'Latin America', 'Middle East', 'Africa', 'Asia Pacific',
                                'India', 'China'],
                    var_name='국가명', value_name='판매량')

# 피벗 테이블을 이용하여 '월'을 컬럼으로, 국가명을 인덱스로 지정
df_pivot = df_melted.pivot_table(index=['국가명', '차종', '공장명(국가)', '연도'],
                                 columns='월',
                                 values='판매량',
                                 aggfunc='sum').reset_index()

# 컬럼명 깔끔하게 정리
df_pivot.columns.name = None

# 결과 확인
print(df_pivot.head())

In [405]:
df_pivot.columns

Index(['국가명', '차종', '공장명(국가)', '연도', '10월', '11월', '12월', '1월', '2월', '3월',
       '4월', '5월', '6월', '7월', '8월', '9월'],
      dtype='object')

In [406]:
# df 컬럼 정리 ('model'→'Model' 변경, 불필요 컬럼 드롭)
df_pivot = df_pivot[['국가명', '공장명(국가)', '차종','1월', '2월', '3월',
       '4월', '5월', '6월', '7월', '8월', '9월', '10월', '11월', '12월','연도']]

In [407]:
df_pivot.columns

Index(['국가명', '공장명(국가)', '차종', '1월', '2월', '3월', '4월', '5월', '6월', '7월', '8월',
       '9월', '10월', '11월', '12월', '연도'],
      dtype='object')

In [408]:
df = df_pivot

In [409]:
df.columns

Index(['국가명', '공장명(국가)', '차종', '1월', '2월', '3월', '4월', '5월', '6월', '7월', '8월',
       '9월', '10월', '11월', '12월', '연도'],
      dtype='object')

In [410]:
df.to_csv("해외현지판매_전처리.CSV", index=False)

In [3]:
import os

base_path = "/Users/mi-yeonlim/Documents/Github/mini-project-2/data/processed"

file_list = {
    "df_zs": "기아_지역별수출실적_전처리.csv",
    "df_cp": "기아_차종별판매실적_전처리.csv",
    "df_fp": "기아_해외공장판매실적_전처리.csv",
    "df_lp": "기아_해외현지판매_전처리.CSV"
}

df = {}

for name, file in file_list.items():
    full_path = os.path.join(base_path, file)
    if os.path.exists(full_path):
        df[name] = pd.read_csv(full_path, encoding='utf-8-sig')
        print(f"{name} 불러오기 성공 ✅")
    else:
        print(f"{name} 파일 없음 ❌ → 경로 확인 필요: {full_path}")

df_zs 불러오기 성공 ✅
df_cp 불러오기 성공 ✅
df_fp 불러오기 성공 ✅
df_lp 불러오기 성공 ✅

In [4]:
df_zs = df["df_zs"]
df_cp = df["df_cp"]
df_fp = df["df_fp"]
df_lp = df["df_lp"]